Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gptm.c
/*********************************************************************************************************//**
 * @brief Enable or Disable hall sensor interface of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_HallInterfaceCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CH0SRC Bit                                                                                   */
    GPTMx->CH0ICFR |= CH0ICFR_CH0SRC;
  }
  else
  {
    /* Reset the CH0SRC Bit                                                                                 */
    GPTMx->CH0ICFR &= ~CH0ICFR_CH0SRC;
  }
}

/*********************************************************************************************************//**
 * @brief Select single pulse mode of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_SinglePulseModeCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    GPTMx->MDCFR |= MDCFR_SPMSET;
  }
  else
  {
    GPTMx->MDCFR &= ~MDCFR_SPMSET;
  }
}

/*********************************************************************************************************//**
 * @brief Select master trigger output source of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Sel: Specify the master trigger output source.
 *        This parameter can be as follow:
 *        @arg GPTM_MMSEL_RESET   : Send trigger signal when S/W setting UEVG or slave restart
 *        @arg GPTM_MMSEL_ENABLE  : The counter enable signal is used as trigger output.
 *        @arg GPTM_MMSEL_UPDATE  : The update event is used as trigger output.
 *        @arg GPTM_MMSEL_CH0CC   : Channel 0 capture or compare match occurred as trigger output.
 *        @arg GPTM_MMSEL_CH0OREF : The CH0OREF signal is used as trigger output.
 *        @arg GPTM_MMSEL_CH1OREF : The CH1OREF signal is used as trigger output.
 *        @arg GPTM_MMSEL_CH2OREF : The CH2OREF signal is used as trigger output.
 *        @arg GPTM_MMSEL_CH3OREF : The CH3OREF signal is used as trigger output.
 * @retval None
 ************************************************************************************************************/
void GPTM_MMSELConfig(HT_GPTM_TypeDef* GPTMx, GPTM_MMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_MMSEL(Sel));

  /* Select the MTO source                                                                                  */
  GPTMx->MDCFR = (GPTMx->MDCFR & MDCFR_MMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Select slave mode of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Sel: Specify the timer slave mode.
 *        This parameter can be one of the following values:
 *        @arg GPTM_SMSEL_RESTART : Slave restart counter mode.
 *        @arg GPTM_SMSEL_PAUSE   : Slave pause counter mode.
 *        @arg GPTM_SMSEL_TRIGGER : Slave trigger counter start mode.
 *        @arg GPTM_SMSEL_STIED   : Used rising edge of STI as prescaler clock source.
 * @retval None
 ************************************************************************************************************/
void GPTM_SlaveModeConfig(HT_GPTM_TypeDef* GPTMx, GPTM_SMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_SLAVE_MODE(Sel));

  /* Select the slave mode                                                                                  */
  GPTMx->MDCFR = (GPTMx->MDCFR & MDCFR_SMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the master & slave GPTMx synchronous function.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_TimSyncCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TSE Bit                                                                                      */
    GPTMx->MDCFR |= MDCFR_TSE;
  }
  else
  {
    /* Reset the TSE Bit                                                                                    */
    GPTMx->MDCFR &= ~MDCFR_TSE;
  }
}

/*********************************************************************************************************//**
 * @brief Set counter register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCounter(HT_GPTM_TypeDef* GPTMx, u16 Counter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the Counter Register value                                                                         */
  GPTMx->CNTR = Counter;
}

