Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gptm.c
/*********************************************************************************************************//**
 * @brief Set counter reload register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCounterReload(HT_GPTM_TypeDef* GPTMx, u16 Reload)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the counter reload register value                                                                  */
  GPTMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare0(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH0CCR register new value                                                                      */
  GPTMx->CH0CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare1(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH1CCR register new value                                                                      */
  GPTMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare2(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH2CCR register new value                                                                      */
  GPTMx->CH2CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare3(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH3CCR register new value                                                                      */
  GPTMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 asymmetric compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH0ACR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetAsymmetricCompare0(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH0ACR register new value                                                                      */
  GPTMx->CH0ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 asymmetric compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH1ACR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetAsymmetricCompare1(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH1ACR register new value                                                                      */
  GPTMx->CH1ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 asymmetric compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Cmp: Specify the CH2ACR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetAsymmetricCompare2(HT_GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH2ACR register new value                                                                      */
  GPTMx->CH2ACR = Cmp;
}

