Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gptm.c
  /* Get the CH3CCR register value                                                                          */
  return GPTMx->CH3CCR;
}

/*********************************************************************************************************//**
 * @brief Get counter value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @return Value of Counter register
 ************************************************************************************************************/
u32 GPTM_GetCounter(HT_GPTM_TypeDef* GPTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the Counter Register value                                                                         */
  return GPTMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @return Value of Prescaler register
 ************************************************************************************************************/
u32 GPTM_GetPrescaler(HT_GPTM_TypeDef* GPTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the Prescaler Register value                                                                       */
  return GPTMx->PSCR;
}

/*********************************************************************************************************//**
 * @brief Generate GPTMx events.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg GPTM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg GPTM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg GPTM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg GPTM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg GPTM_EVENT_UEV       : Timer update event
 *        @arg GPTM_EVENT_TEV       : Timer trigger event
 * @retval None
 ************************************************************************************************************/
void GPTM_GenerateEvent(HT_GPTM_TypeDef* GPTMx, u32 GPTM_EVENT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_EVENT(GPTM_EVENT));

  /* Set the event sources                                                                                  */
  GPTMx->EVGR = GPTM_EVENT;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified GPTMx flag has been set.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_FLAG: Specify the flag to be checked.
 *        This parameter can be one of the following values:
 *        @arg GPTM_FLAG_CH0CC    : GPTM Capture/compare 0 flag
 *        @arg GPTM_FLAG_CH1CC    : GPTM Capture/compare 1 flag
 *        @arg GPTM_FLAG_CH2CC    : GPTM Capture/compare 2 flag
 *        @arg GPTM_FLAG_CH3CC    : GPTM Capture/compare 3 flag
 *        @arg GPTM_FLAG_CH0OC    : GPTM channel 0 overcapture flag
 *        @arg GPTM_FLAG_CH1OC    : GPTM channel 1 overcapture flag
 *        @arg GPTM_FLAG_CH2OC    : GPTM channel 2 overcapture flag
 *        @arg GPTM_FLAG_CH3OC    : GPTM channel 3 overcapture flag
 *        @arg GPTM_FLAG_UEV      : GPTM update flag
 *        @arg GPTM_FLAG_TEV      : GPTM trigger flag
 * @return The new state of GPTM_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus GPTM_GetFlagStatus(HT_GPTM_TypeDef* GPTMx, u32 GPTM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_FLAG(GPTM_FLAG));

  if ((GPTMx->INTSR & GPTM_FLAG) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear flags of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_FLAG: Specify the flag to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_FLAG_CH0CC    : GPTM Capture/compare 0 flag
 *        @arg GPTM_FLAG_CH1CC    : GPTM Capture/compare 1 flag
 *        @arg GPTM_FLAG_CH2CC    : GPTM Capture/compare 2 flag
 *        @arg GPTM_FLAG_CH3CC    : GPTM Capture/compare 3 flag
 *        @arg GPTM_FLAG_CH0OC    : GPTM channel 0 overcapture flag
 *        @arg GPTM_FLAG_CH1OC    : GPTM channel 1 overcapture flag
 *        @arg GPTM_FLAG_CH2OC    : GPTM channel 2 overcapture flag
 *        @arg GPTM_FLAG_CH3OC    : GPTM channel 3 overcapture flag
 *        @arg GPTM_FLAG_UEV      : GPTM update flag
 *        @arg GPTM_FLAG_TEV      : GPTM trigger flag
 * @retval None
 ************************************************************************************************************/
void GPTM_ClearFlag(HT_GPTM_TypeDef* GPTMx, u32 GPTM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_FLAG_CLR(GPTM_FLAG));

  /* Clear the flags                                                                                        */
  GPTMx->INTSR = ~GPTM_FLAG;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-M3 when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

