Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_gptm.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified interrupts of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_INT: Specify the GPTM interrupts sources to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV       : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_IntConfig(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_INT(GPTM_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the interrupt sources                                                                         */
    GPTMx->DICTR |= GPTM_INT;
  }
  else
  {
    /* Disable the interrupt sources                                                                        */
    GPTMx->DICTR &= ~GPTM_INT;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the GPTMx interrupt has occurred.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_INT: Specify the GPTM interrupt source to be checked.
 *        This parameter can be one of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV       : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @return The new state of the GPTM_INT(SET or RESET)
 ************************************************************************************************************/
FlagStatus GPTM_GetIntStatus(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT)
{
  u32 itstatus, itenable;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_GET_INT(GPTM_INT));

  itstatus = GPTMx->INTSR & GPTM_INT;
  itenable = GPTMx->DICTR & GPTM_INT;

  if ((itstatus != 0) && (itenable != 0))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear interrupt pending bits of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param GPTM_INT: Specify the GPTM interrupt to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV       : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @retval None
 ************************************************************************************************************/
void GPTM_ClearIntPendingBit(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_INT(GPTM_INT));

  /* Clear the interrupt pending Bit                                                                        */
  GPTMx->INTSR = ~GPTM_INT;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-M3 when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

/*********************************************************************************************************//**
 * @brief Disable slave mode to clock the prescaler directly with the internal clock.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @retval None
 ************************************************************************************************************/
void GPTM_InternalClockConfig(HT_GPTM_TypeDef* GPTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock                             */
  GPTMx->MDCFR &= MDCFR_SMSEL_MASK;
}

/*********************************************************************************************************//**
 * @brief Select Channel Capture/Compare PDMA event of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param Selection: This parameter can be GPTM_CHCCDS_CHCCEV or GPTM_CHCCDS_UEV.
 * @retval None
 ************************************************************************************************************/
void GPTM_CHCCDSConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CHCCDS_Enum Selection)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CHCCDS(Selection));

  if (Selection != GPTM_CHCCDS_CHCCEV)
  {
    GPTMx->CTR |= CTR_CHCCDS;
  }
  else
  {
    GPTMx->CTR &= ~CTR_CHCCDS;
  }
}

